
clc
clear all

% Опредление результата симуляции в область глобальной видимости
global out;

% Инициализация класса переменных и констант модели
GV = GlobalVar;

% Источник излучения
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Частота источника излучения (Гц)
GV.freq = 433*10^(6);
% Длина волны (м)
GV.wave = physconst('LightSpeed')/GV.freq;

% Время моделирования в одном положении источника (сек)
GV.SimTime = 50/GV.freq;
% Шаг моделирования (сек)
GV.SimStep = (1/1000)*(1/GV.freq);
% Текущий шаг моделирования
GV.MoveStep = 1;

% Опредление траектории источника излучения и числа перемещений
[GV.Azimuth,GV.Elevation,GV.MaxSteps] = Trajectory;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Воздействие среды
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Коэффициент потерь излучения в среде
GV.loss = 1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Приёмная антенная решётка
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Координаты опорной антенны (м)
GV.X0 = 0; GV.Y0 = 0;

% Координаты антенны расположенной на оси x (м)
GV.Xx = 0.34; GV.Yx = 0;
GV.Lx = abs(GV.X0-GV.Xx);

% Координаты антенны расположенной на оси y (м)
GV.Xy = 0; GV.Yy = 0.34;
GV.Ly = abs(GV.Y0-GV.Yy);

% Фазовая задержка для антенны расположенной на оси x
GV.PhaseX = zeros(GV.MaxSteps,1); % в град
GV.PhaseX(GV.MoveStep) = DiffPhase(GV.wave,GV.Azimuth(GV.MoveStep),GV.Elevation(GV.MoveStep),GV.X0,GV.Y0,GV.Xx,GV.Yx);

% Фазовая задержка для антенны расположенной на оси y
GV.PhaseY = zeros(GV.MaxSteps,1); % в град
GV.PhaseY(GV.MoveStep) = DiffPhase(GV.wave,GV.Azimuth(GV.MoveStep),GV.Elevation(GV.MoveStep),GV.X0,GV.Y0,GV.Xy,GV.Yy);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Усилители
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Коэффициент усиления
GV.factor = 5;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Измерители разности фаз
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Период усреднения результатов измерений (сек)
GV.Measure = 10/GV.freq;
% Период счётных импульсов измериетля разности фаз (сек)
GV.Impulse = 1*10^(-12);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Число измрений разности фаз в одном положении источника
GV.MaxCount = floor(GV.SimTime/GV.Measure);

% Инициализация массивов для записи результатов симуляции
GV.OutAzimuth   = zeros(GV.MaxCount,GV.MaxSteps);
GV.OutElevation = zeros(GV.MaxCount,GV.MaxSteps);
GV.OutPhaseX    = zeros(GV.MaxCount,GV.MaxSteps);
GV.OutPhaseY    = zeros(GV.MaxCount,GV.MaxSteps);

% Название модели
GV.ModelName = 'DirectionFinder';

% Запуск окна прогресса симуляции
GV.ProgressBar = waitbar(0,'Modeling in progress...');

% Запуск симуляции
set_param(GV.ModelName,'SimulationCommand','start')

